In [1]:
import database_handler
from pandas_function_handler import pandas_function
from lookups import InputTypes
from database_handler import get_tables_in_schema

In [2]:
db_session = database_handler.create_connection()

In [3]:
if db_session:
    query_df = database_handler.return_data_as_df(db_session= db_session, file= "SELECT * FROM public.rental", input_type= InputTypes.SQL)

c:\Users\User\Desktop\Zahi's assignment\database_handler.py:47: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return_dataframe = pd.read_sql_query(con=db_session, sql=file)

In [4]:
query_df.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-16 02:30:53
1,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-16 02:30:53
2,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-16 02:30:53
3,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-16 02:30:53
4,6,2005-05-24 23:08:07,2792,549,2005-05-27 01:32:07,1,2006-02-16 02:30:53

In [5]:
condition = query_df['rental_id'] > 70
df = pandas_function(query_df, "filter_rows", condition=condition)

In [6]:
df.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
69,71,2005-05-25 10:26:39,2408,100,2005-05-28 04:59:39,1,2006-02-16 02:30:53
70,72,2005-05-25 10:52:13,2260,48,2005-05-28 05:52:13,2,2006-02-16 02:30:53
71,73,2005-05-25 11:00:07,517,391,2005-06-01 13:56:07,2,2006-02-16 02:30:53
72,74,2005-05-25 11:09:48,1744,265,2005-05-26 12:23:48,2,2006-02-16 02:30:53
73,75,2005-05-25 11:13:34,3393,510,2005-06-03 12:58:34,1,2006-02-16 02:30:53

In [7]:
pandas_function(query_df, "get_shape", condition = None)

(16044, 7)

In [9]:
table_names = get_tables_in_schema(db_session = db_session, schema_name="public")
print(table_names)

['actor', 'store', 'top_10_actors', 'address', 'category', 'city', 'country', 'customer', 'film_actor', 'film_category', 'inventory', 'language', 'rental', 'staff', 'payment', 'film']